course4conv.org
#+TITLE: Notes on Coursera, Deep Learning Specification, Convolutional Neural Networks, 2020
#+AUTHOR: By Me
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: H:10
* Week 1: Foundations of Convolutional Neural Networks

** Computer Vision

Deep Learning and computer vision: a match made in heaven!

Tasks:
- Image Classification
- Object Detection
- Neural style transfer

Problem: a metric fuckton of parameters even for moderate size images!

Convolution operation is the fundamental building block of conv nets.

** Edge Detection Example

Vertical edges vs. horizontal edges.

This 3x3 filter (kernel, matrix) can detect vertical edges for example:

| 1 | 0 | -1 |
| 1 | 0 | -1 |
| 1 | 0 | -1 |

/Convolute/ it with your image to apply the filter: element-wise product and addition gives the respective value for the result. Then move filter by a fixed amount and apply again.

E.g., A 6x6 matrix convolved (write '*') with a 3x3 filter, step size 1 to produce a 4x4 matrix.

Convolve in keras: ~Conv2D~

Example:

$$
\begin{pmatrix}
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 
\end{pmatrix}\star\begin{pmatrix}
1 & 0 & -1 \\
1 & 0 & -1 \\
1 & 0 & -1 
\end{pmatrix}=\begin{matrix}
0 & 30 & 30 & 0 \\ 
0 & 30 & 30 & 0 \\ 
0 & 30 & 30 & 0 \\ 
0 & 30 & 30 & 0 \\ 
\end{matrix}
$$

** More Edge Detection

 This detection works similarly with light-to-dark, dark-to-light. Horizontal edges work similarly, too. Just the same for more complicated edges. But do you need a manually created filter for every type of edge? There are many types of filters.

 No, the filters can be /learned/. How? The numbers in the filter are treated as parameters to be learned by backprop! This makes the detection very robust, apparently (there are a few reasoning steps missing here). Much more on the learning later.

** Padding

  n x n image convolved with fxf filter gives an n-f+1 x n-f+1 result.
  2 downsides:
  - Maybe you don't want to image to shrink!
  - Pixels on the corners are used less often.

  Solution: add some padding. E.g. 6x6 * 3x3 = 4x4, with 1 padding all around the result is 6x6 again. Padding should be f-1/2 to retain image size.

Padding value, by convention, is always 0!

*** Valid and Same convolutions

  Valid: p = 0, No padding 
  Same: p = f-1/2

  f is usually odd, so the padding can be symmetric, also the filter has a central pixel.

** Strided Convolution

stride = 2 means that after each filter application, take 2 steps instead of one. This leads to a smaller result matrix.

nxn * fxf, padding p stride s leads to $\frac{n + 2p - f}{s} + 1$ x $\frac{n + 2p - f}{s} + 1$, if not an integer, floor (i.e round down by convention, the filter must lie completely in the image).

Technical note on math textbooks: Often, the filter is first flipped horizontally and vertically. Then the convolution operator is associative. We don't need it though. the convolution shown here might be called cross-correlation in a text book.

** Convolutions over Volume

What to do for RGB images (with three color channels?) So you have a 6x6x3 image. You convolve it with a 3x3x3 filter. 

height x width x #channels. Number of channels in image must match number of channels in the filter.

6x6x3 * 3x3x3 = 4x4 (without padding).

All three channels are convolved together into one result cell.

What if you want to use multiple filter at the same time? Stack the results!

n\times n \times n_c * f \times f \times n_c \rightarrow n-f+1 \times n-f+1 times $n_c^\prime$

where n_c is the number of channels per filter, and $n_c^\prime$ here is the number of filters

number of channels is commonly also called /depth/.

** One Layer of a Conv Net

$$ z^{[1]} = W^{[1]}a^{[0]} + b^{[1]} $$
$$ a^{[1]} = g(z^{[1]} $$

If you have 10 filters that are 3\times 3\times 3 in one layer, how many parameters does that layer have?

One filter has 27 params + bias, 10 filters have 280 parameters. Nice: No matter the size of the image, the # of parameters stays constant \rightarrow less prone to overfitting! it's-a nice-a!

