course4conv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-26 Mo 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on Coursera, Deep Learning Specification, Convolutional Neural Networks</title>
<meta name="author" content="By Me" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Notes on Coursera, Deep Learning Specification, Convolutional Neural Networks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org474ad3a">1. Week 1: Foundations of Convolutional Neural Networks</a>
<ul>
<li><a href="#orga9c6e8d">1.1. Computer Vision</a></li>
<li><a href="#orge0075d2">1.2. Edge Detection Example</a></li>
<li><a href="#orge8f7e35">1.3. More Edge Detection</a></li>
<li><a href="#org4c13984">1.4. Padding</a>
<ul>
<li><a href="#org8368ce1">1.4.1. Valid and Same convolutions</a></li>
</ul>
</li>
<li><a href="#org85ade9c">1.5. Strided Convolution</a></li>
<li><a href="#org6305672">1.6. Convolutions over Volume</a></li>
<li><a href="#org75363d9">1.7. One Layer of a Conv Net</a>
<ul>
<li><a href="#orgeca57fc">1.7.1. Summary of Notation</a></li>
</ul>
</li>
<li><a href="#org28960a0">1.8. Simple Convolutional Network Examples</a></li>
<li><a href="#orgcdbd80b">1.9. Pooling Layers</a></li>
<li><a href="#org02b7f1a">1.10. CNN Example.</a></li>
<li><a href="#orgfea7542">1.11. WHY Convolutions?</a></li>
</ul>
</li>
<li><a href="#org5e9cb4f">2. Week 2: Case Studies</a>
<ul>
<li><a href="#org9e7b9f0">2.1. Classic Networks</a>
<ul>
<li><a href="#org3debd5b">2.1.1. LeNet 5</a></li>
<li><a href="#org488d040">2.1.2. AlexNet</a></li>
<li><a href="#org89294cd">2.1.3. VGG-16</a></li>
</ul>
</li>
<li><a href="#orga7796d8">2.2. ResNets</a>
<ul>
<li><a href="#org5c2865e">2.2.1. Residual blocks</a></li>
</ul>
</li>
<li><a href="#org3f9857b">2.3. Why ResNets Work</a></li>
<li><a href="#orga4a82f7">2.4. Networks in Networks and 1x1 Convolutions</a></li>
<li><a href="#orgd811b5f">2.5. Inception Networks.</a></li>
<li><a href="#org18774bb">2.6. Open Source</a></li>
<li><a href="#org29d54b3">2.7. Transfer Learning</a></li>
<li><a href="#orgdb71550">2.8. Data Augmentation</a></li>
<li><a href="#org1a89f38">2.9. State of Computer Vision</a></li>
</ul>
</li>
<li><a href="#orge95db0c">3. Week 3: Object Detection</a>
<ul>
<li><a href="#org4a8a40b">3.1. Object Localization</a></li>
<li><a href="#org8f3dcdb">3.2. Landmark Detection</a></li>
<li><a href="#org2eeadb5">3.3. Object Detection</a></li>
<li><a href="#org988ad70">3.4. Convolutional Implementation of sliding windows</a></li>
<li><a href="#orgaa7e38e">3.5. Output more accurate bounding boxes</a></li>
<li><a href="#orgf33521d">3.6. Intersection over union</a></li>
<li><a href="#org1feed53">3.7. Non-max suppression example</a></li>
<li><a href="#org5a696e6">3.8. Anchor Boxes</a></li>
<li><a href="#org2c60e31">3.9. YOLO Algorithm</a></li>
<li><a href="#org6b900f2">3.10. Region proposals</a></li>
<li><a href="#org135b6e3">3.11. From the Jupyter Notebook</a></li>
</ul>
</li>
<li><a href="#org1da42c6">4. Week 4: Special applications: Face recognition &amp; Neural style Transfer</a>
<ul>
<li><a href="#org176788c">4.1. Face Recognition</a></li>
<li><a href="#org996748d">4.2. One-shot learning</a></li>
<li><a href="#org7afcf9d">4.3. Siamese Network</a></li>
<li><a href="#org32042fb">4.4. Triplet Loss</a></li>
<li><a href="#org03b6e14">4.5. Face Verification and Binary Classification problem</a></li>
<li><a href="#org497954f">4.6. Neural Style Transfer</a></li>
<li><a href="#orga55ae27">4.7. What are deep Convnets really learning?</a></li>
<li><a href="#orgc93400f">4.8. Cost function</a></li>
<li><a href="#org46e4068">4.9. Content Cost function</a></li>
<li><a href="#org0f76de8">4.10. Style Cost function</a></li>
<li><a href="#orgde9bf53">4.11. 1D and 3D generalization of conv nets</a></li>
<li><a href="#orge4229d5">4.12. Notes from the Jupyter Notebook?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org474ad3a" class="outline-2">
<h2 id="org474ad3a"><span class="section-number-2">1.</span> Week 1: Foundations of Convolutional Neural Networks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga9c6e8d" class="outline-3">
<h3 id="orga9c6e8d"><span class="section-number-3">1.1.</span> Computer Vision</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Deep Learning and computer vision: a match made in heaven!
</p>

<p>
Tasks:
</p>
<ul class="org-ul">
<li>Image Classification</li>
<li>Object Detection</li>
<li>Neural style transfer</li>
</ul>

<p>
Problem: a metric fuckton of parameters even for moderate size images!
</p>

<p>
Convolution operation is the fundamental building block of conv nets.
</p>
</div>
</div>

<div id="outline-container-orge0075d2" class="outline-3">
<h3 id="orge0075d2"><span class="section-number-3">1.2.</span> Edge Detection Example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Vertical edges vs. horizontal edges.
</p>

<p>
This 3x3 filter (kernel, matrix) can detect vertical edges for example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
</tr>
</tbody>
</table>

<p>
<i>Convolute</i> it with your image to apply the filter: element-wise product and addition gives the respective value for the result. Then move filter by a fixed amount and apply again.
</p>

<p>
E.g., A 6x6 matrix convolved (write &rsquo;*&rsquo;) with a 3x3 filter, step size 1 to produce a 4x4 matrix.
</p>

<p>
Convolve in keras: <code>Conv2D</code>
</p>

<p>
Example:
</p>

<p>
\[
\begin{pmatrix}
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 \\
10 & 10 & 10 & 0 & 0 & 0 
\end{pmatrix}\star\begin{pmatrix}
1 & 0 & -1 \\
1 & 0 & -1 \\
1 & 0 & -1 
\end{pmatrix}=\begin{matrix}
0 & 30 & 30 & 0 \\ 
0 & 30 & 30 & 0 \\ 
0 & 30 & 30 & 0 \\ 
0 & 30 & 30 & 0 \\ 
\end{matrix}
\]
</p>
</div>
</div>

<div id="outline-container-orge8f7e35" class="outline-3">
<h3 id="orge8f7e35"><span class="section-number-3">1.3.</span> More Edge Detection</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This detection works similarly with light-to-dark, dark-to-light. Horizontal edges work similarly, too. Just the same for more complicated edges. But do you need a manually created filter for every type of edge? There are many types of filters.
</p>

<p>
No, the filters can be <i>learned</i>. How? The numbers in the filter are treated as parameters to be learned by backprop! This makes the detection very robust, apparently (there are a few reasoning steps missing here). Much more on the learning later.
</p>
</div>
</div>

<div id="outline-container-org4c13984" class="outline-3">
<h3 id="org4c13984"><span class="section-number-3">1.4.</span> Padding</h3>
<div class="outline-text-3" id="text-1-4">
<p>
n x n image convolved with fxf filter gives an n-f+1 x n-f+1 result.
2 downsides:
</p>
<ul class="org-ul">
<li>Maybe you don&rsquo;t want to image to shrink!</li>
<li>Pixels on the corners are used less often.</li>
</ul>

<p>
Solution: add some padding. E.g. 6x6 * 3x3 = 4x4, with 1 padding all around the result is 6x6 again. Padding should be f-1/2 to retain image size.
</p>

<p>
Padding value, by convention, is always 0!
</p>
</div>

<div id="outline-container-org8368ce1" class="outline-4">
<h4 id="org8368ce1"><span class="section-number-4">1.4.1.</span> Valid and Same convolutions</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Valid: p = 0, No padding 
Same: p = f-1/2
</p>

<p>
f is usually odd, so the padding can be symmetric, also the filter has a central pixel.
</p>
</div>
</div>
</div>

<div id="outline-container-org85ade9c" class="outline-3">
<h3 id="org85ade9c"><span class="section-number-3">1.5.</span> Strided Convolution</h3>
<div class="outline-text-3" id="text-1-5">
<p>
stride = 2 means that after each filter application, take 2 steps instead of one. This leads to a smaller result matrix.
</p>

<p>
nxn * fxf, padding p stride s leads to \(\frac{n + 2p - f}{s} + 1\) x \(\frac{n + 2p - f}{s} + 1\), if not an integer, floor (i.e round down by convention, the filter must lie completely in the image).
</p>

<p>
Technical note on math textbooks: Often, the filter is first flipped horizontally and vertically. Then the convolution operator is associative. We don&rsquo;t need it though. the convolution shown here might be called cross-correlation in a text book.
</p>
</div>
</div>

<div id="outline-container-org6305672" class="outline-3">
<h3 id="org6305672"><span class="section-number-3">1.6.</span> Convolutions over Volume</h3>
<div class="outline-text-3" id="text-1-6">
<p>
What to do for RGB images (with three color channels?) So you have a 6x6x3 image. You convolve it with a 3x3x3 filter. 
</p>

<p>
height x width x #channels. Number of channels in image must match number of channels in the filter.
</p>

<p>
6x6x3 * 3x3x3 = 4x4 (without padding).
</p>

<p>
All three channels are convolved together into one result cell.
</p>

<p>
What if you want to use multiple filter at the same time? Stack the results!
</p>

<p>
n&times; n &times; n<sub>c</sub> * f &times; f &times; n<sub>c</sub> &rarr; n-f+1 &times; n-f+1 times \(n_c^\prime\)
</p>

<p>
where n<sub>c</sub> is the number of channels per filter, and \(n_c^\prime\) here is the number of filters
</p>

<p>
number of channels is commonly also called <i>depth</i>.
</p>
</div>
</div>

<div id="outline-container-org75363d9" class="outline-3">
<h3 id="org75363d9"><span class="section-number-3">1.7.</span> One Layer of a Conv Net</h3>
<div class="outline-text-3" id="text-1-7">
<p>
\[ z^{[1]} = W^{[1]}a^{[0]} + b^{[1]} \]
\[ a^{[1]} = g(z^{[1]} \]
</p>

<p>
If you have 10 filters that are 3&times; 3&times; 3 in one layer, how many parameters does that layer have?
</p>

<p>
One filter has 27 params + bias, 10 filters have 280 parameters. Nice: No matter the size of the image, the # of parameters stays constant &rarr; less prone to overfitting! it&rsquo;s-a nice-a!
</p>
</div>
