course4conv.org
*** Summary of Notation
if layer $l$ is a convolution layer:
- $f^{[l]}$ filter size
- $p^{[l]}$ padding
- s^{[l]} stride
- input: n_H^{[l-1]} \times n_W^{[l-1]} \times n_c^{[l-1]}
- output: n_H^{[l]} \times n_W^{[l]} \times n_c^{[l]}
- $n_H^{[l]} = \text{floor}( \frac{n_H^{[l-1]} - 2p^{[l]} - f^{[l]}}{s^{[l]}} + 1)$
- $n_W^{[l]} = \text{floor}( \frac{n_W^{[l-1]} - 2p^{[l]} - f^{[l]}}{s^{[l]}} + 1)$
- Each filter is $f^{[l]} \times f^{[l]} \times n_c^{[l-1]}$
- activations: $a^{[l]} \rightarrow n_H^{[l]} \times n_W^{[l]} \times n_c^{[l]}$, $A^{[l]} \rightarrow m \times n_H^{[l]} \times n_W^{[l]} \times n_c^{[l]}$.
- Weights: $f^{[l]} \times f^{[l]} \times n_c^{[l-1]} \times n_c^{[l]}$, where $n_c^{[l]}$ is the number of filters in layer $l$.

** Simple Convolutional Network Examples

Example conv net

$n_H^{[0]} = n_W^{[0]} = 39, n_c^{[0]} = 3$.

$39\times3 9\times 3 \rightarrow_{(f^{[1]} = 3, s^{[1]} = 1, p^{[1]} = 0, \text{ 10 filters} )} 37\times 37\times 10$ 

$n_H^{[1]} = n_W^{[1]} = 37, n_c^{[1]} = 10$.

$37\times 37\times 10 \rightarrow_{(f^{[2]} = 5, s^{[2]} = 2, p^{[2]} = 0, \text{ 20 filters})} 17\times 17\times 20$   

$n_H^{[2]} = n_W^{[2]} = 17, n_c^{[2]} = 20$.

$17\times 17\times 20 \rightarrow_{(f^{[2]} = 5, s^{[2]} = 2, p^{[2]} = 0, \text{ 40 filters})} 7\times 7\times 40$   

$n_H^{[3]} = n_W^{[3]} = 7, n_c^{[3]} = 40$.

$7 \times 7 \times 40 \rightarrow_{\text{fully connected}} 1 \times 1960 \rightarrow \text{softmax}$

Typically, you start with larger images and go down in size, but the number of channels increases.

Types of layers:
 - conv
 - pool
 - fully connected

** Pooling Layers

Output of a filter is just the max value of it's region. You still have $f$ as the filter size and $s$ as the stride.  

Intuitively, max pooling selects the feature detected by that region, which is more likely to have a high value (?). Experimentally it works well, that's probably the real reason.

For the result it still holds that:

$n \times n \times n_c \rightarrow floor(\frac{n +2p - f}{s} + 1) \times floor(\frac{n +2p - f}{s} + 1) \times n_c$. Simple! 

Also, we have average pooling, where you take the average instead of max pooling. This is sometimes used to collapse the representation deep in the network.

Common choices for pooling: $f = 2, s = 2$ or $f=3,s=2$, usually no padding.

** CNN Example.

Similar to LeNet-5. There is disagreement about what is called a layer. Because the pooling layer doesn't have parameters (only hyperparameters) it is usually not counted as a layer. So a conv and a pool layer are grouped into one layer.

$n_H^{[0]} = n_W^{[0]} = 32, n_c^{[0]} = 3$.

$32\times 32\times 3 \rightarrow_{(\text{conv_1}, f = 5, s = 1, \text{ 6 filters} )} 28\times 28\times 6$ 

$\rightarrow_{(\text{pool_1}, f = 2, s=2)} 14 \times 14 \times 6$

$\rightarrow_{(\text{conv_2}, f = 5, s = 1, \text{ 16 filters} )} 10\times 10\times 16$ 

$\rightarrow_{(\text{pool_2}, f = 2, s=2)} 5 \times 5 \times 16$

$\rightarrow_{(\text{fc_3})} 120\times 1$

$\rightarrow_{(\text{fc_4})} 84\times 1$

$\rightarrow_{(\text{softmax_5})} 10\times 1$

Usually $n_H, n_W$ decrease, $n_c$ increases. Alternating conv/pool layers pretty common.

** WHY Convolutions?

Why are they so useful, these convolutions?

Two main advantages: 
- parameter sharing
- sparsity of connection

For small images already the parameters size is RIDICOLOUSly huge! Conv nets have smaller numbers, they /share/ parameters. The reasoning is something along the line that visual patterns which can be recognized will be repeated throughout the image, so a feature detector (i.e. filter) will be successfully reused.

In addition, each cell of an output depends only on few cells of the input, making the connections sparse.

This makes the parameter number much smaller, so less prone to overfitting. Implements translational invariance, meaning robustness in the face of moving around image parts.

* Week 2: Case Studies

We're looking at some classic, pretty effective networks. Also let's look at ResNet with 152 layers. Many ideas cross-fertilize and might be interesting for other areas than computer vision. Hehe. he said fertilize. 

** Classic Networks

*** LeNet 5 

Recognize handwritten digits. Quite similar to last week's example.  About 60k examples.

Conv \rightarrow avg pool \rightarrow conv \rightarrow avg pool \rightarrow fc sigmoid  rightarrow fc sigmoid \rightarrow \hat{y} 

People didn't really use padding, so the size shrinks every layer. Also, they still used average pooling. Also, sigmoid and tanh were much more common than ReLU. There are some complexity details used for speeding up computation which wouldn't be relevant today.

*** AlexNet 

Conv \rightarrow max pool \rightarrow conv \rightarrow max pool \rightarrow conv \rightarrow conv \rightarrow conv \rightarrow max pool \rightarrow fc \rightarrow \rightarrow fc \rightarrow fc \rightarrow softmax 

About 60M parameters, using ReLU. Uses a complicated way to use two GPUs. This paper had a huge impact of the usage of deep learning in Computer vision. Worth to read the paper! Convinced many Computer Vision researchers to take a better look at Deep Learning. 2012

*** VGG-16

conv 2x \rightarrow pool \rightarrow conv 2x \rightarrow pool \rightarrow conv 3x \rightarrow pool \rightarrow conv3x \rightarrow pool \rightarrow conv 3x \rightarrow pool \rightarrow fc \rightarrow fc \rightarrow softmax 

138M parameters. 

The pattern, again: height, width go down as you go deeper. The number of channels increases, though. 'Very deep' network.

** ResNets

Vanishing, exploding gradient kind of problems appear for convnets, too, mostly in very deep networks, of course.

*** Residual blocks 

Generally, networks work like:

$$a^{[l]} \rightarrow linear \rightarrow ReLU \rightarrow a^{[l+1]} \rightarrow \dots$$ 

In resnets, you add the output of a previous layer to the input to the activation function of a layer some steps down the line. For example: 

$$a^{[l+2]} = g(z^{[l+2]} + a^{[l]})$$

Layer $l$ and $l+1$ are then called a residual block. Sometimes called 'skip connection'.

Residual blocks allow you to train much deeper networks. It helps with the training error. 

In practice, often the training error goes back up after decreasing when adding more layers. ResNets help keep the training error going down.

Why does it do so? We'll see an intuition now.

