course4conv.html

<div id="outline-container-orgeca57fc" class="outline-4">
<h4 id="orgeca57fc"><span class="section-number-4">1.7.1.</span> Summary of Notation</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
if layer \(l\) is a convolution layer:
</p>
<ul class="org-ul">
<li>\(f^{[l]}\) filter size</li>
<li>\(p^{[l]}\) padding</li>
<li>s<sup>[l]</sup> stride</li>
<li>input: n<sub>H</sub><sup>[l-1]</sup> &times; n<sub>W</sub><sup>[l-1]</sup> &times; n<sub>c</sub><sup>[l-1]</sup></li>
<li>output: n<sub>H</sub><sup>[l]</sup> &times; n<sub>W</sub><sup>[l]</sup> &times; n<sub>c</sub><sup>[l]</sup></li>
<li>\(n_H^{[l]} = \text{floor}( \frac{n_H^{[l-1]} - 2p^{[l]} - f^{[l]}}{s^{[l]}} + 1)\)</li>
<li>\(n_W^{[l]} = \text{floor}( \frac{n_W^{[l-1]} - 2p^{[l]} - f^{[l]}}{s^{[l]}} + 1)\)</li>
<li>Each filter is \(f^{[l]} \times f^{[l]} \times n_c^{[l-1]}\)</li>
<li>activations: \(a^{[l]} \rightarrow n_H^{[l]} \times n_W^{[l]} \times n_c^{[l]}\), \(A^{[l]} \rightarrow m \times n_H^{[l]} \times n_W^{[l]} \times n_c^{[l]}\).</li>
<li>Weights: \(f^{[l]} \times f^{[l]} \times n_c^{[l-1]} \times n_c^{[l]}\), where \(n_c^{[l]}\) is the number of filters in layer \(l\).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org28960a0" class="outline-3">
<h3 id="org28960a0"><span class="section-number-3">1.8.</span> Simple Convolutional Network Examples</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Example conv net
</p>

<p>
\(n_H^{[0]} = n_W^{[0]} = 39, n_c^{[0]} = 3\).
</p>

<p>
\(39\times3 9\times 3 \rightarrow_{(f^{[1]} = 3, s^{[1]} = 1, p^{[1]} = 0, \text{ 10 filters} )} 37\times 37\times 10\) 
</p>

<p>
\(n_H^{[1]} = n_W^{[1]} = 37, n_c^{[1]} = 10\).
</p>

<p>
\(37\times 37\times 10 \rightarrow_{(f^{[2]} = 5, s^{[2]} = 2, p^{[2]} = 0, \text{ 20 filters})} 17\times 17\times 20\)   
</p>

<p>
\(n_H^{[2]} = n_W^{[2]} = 17, n_c^{[2]} = 20\).
</p>

<p>
\(17\times 17\times 20 \rightarrow_{(f^{[2]} = 5, s^{[2]} = 2, p^{[2]} = 0, \text{ 40 filters})} 7\times 7\times 40\)   
</p>

<p>
\(n_H^{[3]} = n_W^{[3]} = 7, n_c^{[3]} = 40\).
</p>

<p>
\(7 \times 7 \times 40 \rightarrow_{\text{fully connected}} 1 \times 1960 \rightarrow \text{softmax}\)
</p>

<p>
Typically, you start with larger images and go down in size, but the number of channels increases.
</p>

<p>
Types of layers:
</p>
<ul class="org-ul">
<li>conv</li>
<li>pool</li>
<li>fully connected</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdbd80b" class="outline-3">
<h3 id="orgcdbd80b"><span class="section-number-3">1.9.</span> Pooling Layers</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Output of a filter is just the max value of it&rsquo;s region. You still have \(f\) as the filter size and \(s\) as the stride.  
</p>

<p>
Intuitively, max pooling selects the feature detected by that region, which is more likely to have a high value (?). Experimentally it works well, that&rsquo;s probably the real reason.
</p>

<p>
For the result it still holds that:
</p>

<p>
\(n \times n \times n_c \rightarrow floor(\frac{n +2p - f}{s} + 1) \times floor(\frac{n +2p - f}{s} + 1) \times n_c\). Simple! 
</p>

<p>
Also, we have average pooling, where you take the average instead of max pooling. This is sometimes used to collapse the representation deep in the network.
</p>

<p>
Common choices for pooling: \(f = 2, s = 2\) or \(f=3,s=2\), usually no padding.
</p>
</div>
</div>

<div id="outline-container-org02b7f1a" class="outline-3">
<h3 id="org02b7f1a"><span class="section-number-3">1.10.</span> CNN Example.</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Similar to LeNet-5. There is disagreement about what is called a layer. Because the pooling layer doesn&rsquo;t have parameters (only hyperparameters) it is usually not counted as a layer. So a conv and a pool layer are grouped into one layer.
</p>

<p>
\(n_H^{[0]} = n_W^{[0]} = 32, n_c^{[0]} = 3\).
</p>

<p>
\(32\times 32\times 3 \rightarrow_{(\text{conv_1}, f = 5, s = 1, \text{ 6 filters} )} 28\times 28\times 6\) 
</p>

<p>
\(\rightarrow_{(\text{pool_1}, f = 2, s=2)} 14 \times 14 \times 6\)
</p>

<p>
\(\rightarrow_{(\text{conv_2}, f = 5, s = 1, \text{ 16 filters} )} 10\times 10\times 16\) 
</p>

<p>
\(\rightarrow_{(\text{pool_2}, f = 2, s=2)} 5 \times 5 \times 16\)
</p>

<p>
\(\rightarrow_{(\text{fc_3})} 120\times 1\)
</p>

<p>
\(\rightarrow_{(\text{fc_4})} 84\times 1\)
</p>

<p>
\(\rightarrow_{(\text{softmax_5})} 10\times 1\)
</p>

<p>
Usually \(n_H, n_W\) decrease, \(n_c\) increases. Alternating conv/pool layers pretty common.
</p>
</div>
</div>

<div id="outline-container-orgfea7542" class="outline-3">
<h3 id="orgfea7542"><span class="section-number-3">1.11.</span> WHY Convolutions?</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Why are they so useful, these convolutions?
</p>

<p>
Two main advantages: 
</p>
<ul class="org-ul">
<li>parameter sharing</li>
<li>sparsity of connection</li>
</ul>

<p>
For small images already the parameters size is RIDICOLOUSly huge! Conv nets have smaller numbers, they <i>share</i> parameters. The reasoning is something along the line that visual patterns which can be recognized will be repeated throughout the image, so a feature detector (i.e. filter) will be successfully reused.
</p>

<p>
In addition, each cell of an output depends only on few cells of the input, making the connections sparse.
</p>

<p>
This makes the parameter number much smaller, so less prone to overfitting. Implements translational invariance, meaning robustness in the face of moving around image parts.
</p>
</div>
</div>
</div>

<div id="outline-container-org5e9cb4f" class="outline-2">
<h2 id="org5e9cb4f"><span class="section-number-2">2.</span> Week 2: Case Studies</h2>
<div class="outline-text-2" id="text-2">
<p>
We&rsquo;re looking at some classic, pretty effective networks. Also let&rsquo;s look at ResNet with 152 layers. Many ideas cross-fertilize and might be interesting for other areas than computer vision. Hehe. he said fertilize. 
</p>
</div>

<div id="outline-container-org9e7b9f0" class="outline-3">
<h3 id="org9e7b9f0"><span class="section-number-3">2.1.</span> Classic Networks</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org3debd5b" class="outline-4">
<h4 id="org3debd5b"><span class="section-number-4">2.1.1.</span> LeNet 5</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Recognize handwritten digits. Quite similar to last week&rsquo;s example.  About 60k examples.
</p>

<p>
Conv &rarr; avg pool &rarr; conv &rarr; avg pool &rarr; fc sigmoid  rightarrow fc sigmoid &rarr; \hat{y} 
</p>

<p>
People didn&rsquo;t really use padding, so the size shrinks every layer. Also, they still used average pooling. Also, sigmoid and tanh were much more common than ReLU. There are some complexity details used for speeding up computation which wouldn&rsquo;t be relevant today.
</p>
</div>
</div>

<div id="outline-container-org488d040" class="outline-4">
<h4 id="org488d040"><span class="section-number-4">2.1.2.</span> AlexNet</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Conv &rarr; max pool &rarr; conv &rarr; max pool &rarr; conv &rarr; conv &rarr; conv &rarr; max pool &rarr; fc &rarr; &rarr; fc &rarr; fc &rarr; softmax 
</p>

<p>
About 60M parameters, using ReLU. Uses a complicated way to use two GPUs. This paper had a huge impact of the usage of deep learning in Computer vision. Worth to read the paper! Convinced many Computer Vision researchers to take a better look at Deep Learning. 2012
</p>
</div>
</div>

<div id="outline-container-org89294cd" class="outline-4">
<h4 id="org89294cd"><span class="section-number-4">2.1.3.</span> VGG-16</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
conv 2x &rarr; pool &rarr; conv 2x &rarr; pool &rarr; conv 3x &rarr; pool &rarr; conv3x &rarr; pool &rarr; conv 3x &rarr; pool &rarr; fc &rarr; fc &rarr; softmax 
</p>

<p>
138M parameters. 
</p>

<p>
The pattern, again: height, width go down as you go deeper. The number of channels increases, though. &rsquo;Very deep&rsquo; network.
</p>
</div>
</div>
</div>

<div id="outline-container-orga7796d8" class="outline-3">
<h3 id="orga7796d8"><span class="section-number-3">2.2.</span> ResNets</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Vanishing, exploding gradient kind of problems appear for convnets, too, mostly in very deep networks, of course.
</p>
</div>

<div id="outline-container-org5c2865e" class="outline-4">
<h4 id="org5c2865e"><span class="section-number-4">2.2.1.</span> Residual blocks</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Generally, networks work like:
</p>

<p>
\[a^{[l]} \rightarrow linear \rightarrow ReLU \rightarrow a^{[l+1]} \rightarrow \dots\] 
</p>

<p>
In resnets, you add the output of a previous layer to the input to the activation function of a layer some steps down the line. For example: 
</p>

<p>
\[a^{[l+2]} = g(z^{[l+2]} + a^{[l]})\]
</p>

<p>
Layer \(l\) and \(l+1\) are then called a residual block. Sometimes called &rsquo;skip connection&rsquo;.
</p>

<p>
Residual blocks allow you to train much deeper networks. It helps with the training error. 
</p>

<p>
In practice, often the training error goes back up after decreasing when adding more layers. ResNets help keep the training error going down.
</p>

<p>
Why does it do so? We&rsquo;ll see an intuition now.
</p>
</div>
</div>
</div>
