course4conv.org
** Why ResNets Work

Let's look at an example. We have a Big 'plain' NN with ReLU and look at actiations  of layer $a^{[l]}$. In a second identical network, we add a ResBlock to $a^{[l]}$, s.t. $a^{[l+2]} = g(z^{[l+2]} + a^{[l]})$. If the weights $W^{[l+2]}$ and $b^{[l+2]}$ are zero, then the ResBlock gives the identity function (for ReLUs). So the identity function is *very easy to learn* for a ResBlock. In standard nets, these are difficult to learn. So in many cases, the layers make your result worse, not better. ResBlocks at least don't hurt your performance, but may improve it! 

** Networks in Networks and 1x1 Convolutions

A 1x1 conv gives a single real number for each 'depth slice'. It is basically having a fully connected layer (network) applying to each of the pixels. 

Example:

28x28x192 \rightarrow 28x28x32 with 32 filters of 1x1x192 size.

Verry useful to build an INCEPTION NETWORK!!

Also a way to shrink the number of channels to save on computation. Also adds non-linearity.

** Inception Networks.

Instead of choosing pooling, conv with particular filter size, 1x1, do them all in one, concatenating the results.

Also, implement a bottleneck layer to improve computational cost for large convolution layers.

The Inception network is just a bunch of inception layers. 

** Open Source

Often open source implementations are available if you want to replicate a paper's applications. Search for 'type of network + github'. 

Workflow: Pick architecture that you like, look for open source implementation and go from there. Another advantage: Often pre-trained networks are available.

** Transfer Learning

Use hyperparameters from others! Yay.

Reuse trained network and change the last layer to learn about your dataset. 'Freeze' all reused layers during training.

If you have a larger training set, freeze fewer layers maybe? Use last few layers as initial configuration or start with fresh new layers. 

If you have a lot of data, you may use the whole thing as initialization and retrain the whole net.

For lots of computer vision applications, transfer learning is something you should almost always do, except if you have loads of data and computational resources (unlikely).

** Data Augmentation

More Data! with augmentation. 

- Mirroring
- random cropping
- color shifting: Add distortions to RGB channels, e.g. +20,-20,+20, draw from distribution. This simulates different lighting conditions. Additionally, use PCA color augmentation (google it).

How to implement during training? Fix one or multiple CPU thread to distort images from disk, per mini_batch training. Can run in parallel to training.

** State of Computer Vision

What's special about computer vision? 
Object Detection \rightarrow Image recognition \rightarrow speech recognition 
little data \rightarrow lots'o'data
more hand-engineering ('hacks') \rightarrow less hand-engineering (simpler algorithms)

Often, we don't have as much data as we need. Transfer learning helps a lot with little data. 

Doing well on benchmarks is different from production/reality, but may help to find efficient algorithms. These help with benchmarking:
- Ensembling: average outputs of multiple networks
- Multicrop at test time: run classifier on multiple versions of test image and average results
 
Use open source projects! Implementations! Use pretrained models!

* Week 3: Object Detection

** Object Localization

Object localization vs. object detection.

Image classification: Standard classifier (1 object)
Classification wit localization: Additionally, locate the object within a bounding box. (1 object)
Detection: Possibly multiple objects of different categories.

Example. Classifier with categories via softmax
- pedestrian
- car
- motorcycle
- background (i.e. none of the above)

Localization: Additionally outputs for bounding box of localized object. Determine bounding box via $b_x, b_y, b_h, b_w$.

y consists of:
- $p_c$ probability of is there an object?
- $b_x, b_y, b_h, b_w$ bounding box
- $c_1, c_2, c_3$ category probabilities.

Training data if there is no object is a don't care '?'-filled data point. This matters for the definition of the loss function.

If $y_1 = 1$ then $\mathcal{L}(\hat{y}, y) = (\hat{y_1} - y_1)^2 + (\hat{y_2} - y_2)^2 + \dots + (\hat{y_8} - y_8)^2$,

If $y_1 = 0$ then $\mathcal{L}(\hat{y}, y) = (\hat{y_1} - y_1)^2$.

In practice, log likelihood loss is also fine. 

** Landmark Detection

Just output x,y coordinates. For example, important feature points of a face, like bounds of faces. Use 64 or more coordinates? No problem! Just need applicable training data. Also helpful for pose detection.

** Object Detection

Sliding windows detection algorithm. Example: Cars. Training set with closely cropped car/non-car images. Train a network on this data. Then, take a /sliding window/ over your image and feed each windows slice into your conv net to check for cars. Once over is helpful, but now you repeat with a slightly larger region, and repeat again. Problem: costly computation. Before deep learning, this was kind of feasible. What's the solution? Convolutional implementation!

** Convolutional Implementation of sliding windows

Turn a fully connected layer into a convolutional layer. Take a $5\times 5\times 16$ layer and apply 400 filters of size $5\times 5$ to simulate an fc layer.

Using fc layers like this, you can implement sliding windows via convolution. Take the same configuration for your conv net and run it on a larger image. The result is an 'image' that contains the results of the classification of the sliding window. You can control the parameters like stride of the sliding window through the size of an intermediate max pool layer. How exactly does it work? Needs more general explanation. It's hilariously poor in the video.

** Output more accurate bounding boxes

YOLO algorithm (You only look once) for the problem of bounding boxes not matching up with the objects in the picture. 

Very similar to object localization algorithm, but with an output for $19\times19$ grid cells, with 8 output values each (in this example). This is a convolutions implementation, and runs quite fast!

$$ \hat{y} = \begin{pmatrix}c \\ b_x \\ b_y \\ b_h \\ b_w \\ c_p \\ c_m \\ c_c \end{pmatrix} $$

Where $0 \leq b_x, b_y, b_h, b_w \leq 1$.

