course4conv.html

<div id="outline-container-org3f9857b" class="outline-3">
<h3 id="org3f9857b"><span class="section-number-3">2.3.</span> Why ResNets Work</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Let&rsquo;s look at an example. We have a Big &rsquo;plain&rsquo; NN with ReLU and look at actiations  of layer \(a^{[l]}\). In a second identical network, we add a ResBlock to \(a^{[l]}\), s.t. \(a^{[l+2]} = g(z^{[l+2]} + a^{[l]})\). If the weights \(W^{[l+2]}\) and \(b^{[l+2]}\) are zero, then the ResBlock gives the identity function (for ReLUs). So the identity function is <b>very easy to learn</b> for a ResBlock. In standard nets, these are difficult to learn. So in many cases, the layers make your result worse, not better. ResBlocks at least don&rsquo;t hurt your performance, but may improve it! 
</p>
</div>
</div>

<div id="outline-container-orga4a82f7" class="outline-3">
<h3 id="orga4a82f7"><span class="section-number-3">2.4.</span> Networks in Networks and 1x1 Convolutions</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A 1x1 conv gives a single real number for each &rsquo;depth slice&rsquo;. It is basically having a fully connected layer (network) applying to each of the pixels. 
</p>

<p>
Example:
</p>

<p>
28x28x192 &rarr; 28x28x32 with 32 filters of 1x1x192 size.
</p>

<p>
Verry useful to build an INCEPTION NETWORK!!
</p>

<p>
Also a way to shrink the number of channels to save on computation. Also adds non-linearity.
</p>
</div>
</div>

<div id="outline-container-orgd811b5f" class="outline-3">
<h3 id="orgd811b5f"><span class="section-number-3">2.5.</span> Inception Networks.</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Instead of choosing pooling, conv with particular filter size, 1x1, do them all in one, concatenating the results.
</p>

<p>
Also, implement a bottleneck layer to improve computational cost for large convolution layers.
</p>

<p>
The Inception network is just a bunch of inception layers. 
</p>
</div>
</div>

<div id="outline-container-org18774bb" class="outline-3">
<h3 id="org18774bb"><span class="section-number-3">2.6.</span> Open Source</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Often open source implementations are available if you want to replicate a paper&rsquo;s applications. Search for &rsquo;type of network + github&rsquo;. 
</p>

<p>
Workflow: Pick architecture that you like, look for open source implementation and go from there. Another advantage: Often pre-trained networks are available.
</p>
</div>
</div>

<div id="outline-container-org29d54b3" class="outline-3">
<h3 id="org29d54b3"><span class="section-number-3">2.7.</span> Transfer Learning</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Use hyperparameters from others! Yay.
</p>

<p>
Reuse trained network and change the last layer to learn about your dataset. &rsquo;Freeze&rsquo; all reused layers during training.
</p>

<p>
If you have a larger training set, freeze fewer layers maybe? Use last few layers as initial configuration or start with fresh new layers. 
</p>

<p>
If you have a lot of data, you may use the whole thing as initialization and retrain the whole net.
</p>

<p>
For lots of computer vision applications, transfer learning is something you should almost always do, except if you have loads of data and computational resources (unlikely).
</p>
</div>
</div>

<div id="outline-container-orgdb71550" class="outline-3">
<h3 id="orgdb71550"><span class="section-number-3">2.8.</span> Data Augmentation</h3>
<div class="outline-text-3" id="text-2-8">
<p>
More Data! with augmentation. 
</p>

<ul class="org-ul">
<li>Mirroring</li>
<li>random cropping</li>
<li>color shifting: Add distortions to RGB channels, e.g. +20,-20,+20, draw from distribution. This simulates different lighting conditions. Additionally, use PCA color augmentation (google it).</li>
</ul>

<p>
How to implement during training? Fix one or multiple CPU thread to distort images from disk, per mini<sub>batch</sub> training. Can run in parallel to training.
</p>
</div>
</div>

<div id="outline-container-org1a89f38" class="outline-3">
<h3 id="org1a89f38"><span class="section-number-3">2.9.</span> State of Computer Vision</h3>
<div class="outline-text-3" id="text-2-9">
<p>
What&rsquo;s special about computer vision? 
Object Detection &rarr; Image recognition &rarr; speech recognition 
little data &rarr; lots&rsquo;o&rsquo;data
more hand-engineering (&rsquo;hacks&rsquo;) &rarr; less hand-engineering (simpler algorithms)
</p>

<p>
Often, we don&rsquo;t have as much data as we need. Transfer learning helps a lot with little data. 
</p>

<p>
Doing well on benchmarks is different from production/reality, but may help to find efficient algorithms. These help with benchmarking:
</p>
<ul class="org-ul">
<li>Ensembling: average outputs of multiple networks</li>
<li>Multicrop at test time: run classifier on multiple versions of test image and average results</li>
</ul>

<p>
Use open source projects! Implementations! Use pretrained models!
</p>
</div>
</div>
</div>

<div id="outline-container-orge95db0c" class="outline-2">
<h2 id="orge95db0c"><span class="section-number-2">3.</span> Week 3: Object Detection</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4a8a40b" class="outline-3">
<h3 id="org4a8a40b"><span class="section-number-3">3.1.</span> Object Localization</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Object localization vs. object detection.
</p>

<p>
Image classification: Standard classifier (1 object)
Classification wit localization: Additionally, locate the object within a bounding box. (1 object)
Detection: Possibly multiple objects of different categories.
</p>

<p>
Example. Classifier with categories via softmax
</p>
<ul class="org-ul">
<li>pedestrian</li>
<li>car</li>
<li>motorcycle</li>
<li>background (i.e. none of the above)</li>
</ul>

<p>
Localization: Additionally outputs for bounding box of localized object. Determine bounding box via \(b_x, b_y, b_h, b_w\).
</p>

<p>
y consists of:
</p>
<ul class="org-ul">
<li>\(p_c\) probability of is there an object?</li>
<li>\(b_x, b_y, b_h, b_w\) bounding box</li>
<li>\(c_1, c_2, c_3\) category probabilities.</li>
</ul>

<p>
Training data if there is no object is a don&rsquo;t care &rsquo;?&rsquo;-filled data point. This matters for the definition of the loss function.
</p>

<p>
If \(y_1 = 1\) then \(\mathcal{L}(\hat{y}, y) = (\hat{y_1} - y_1)^2 + (\hat{y_2} - y_2)^2 + \dots + (\hat{y_8} - y_8)^2\),
</p>

<p>
If \(y_1 = 0\) then \(\mathcal{L}(\hat{y}, y) = (\hat{y_1} - y_1)^2\).
</p>

<p>
In practice, log likelihood loss is also fine. 
</p>
</div>
</div>

<div id="outline-container-org8f3dcdb" class="outline-3">
<h3 id="org8f3dcdb"><span class="section-number-3">3.2.</span> Landmark Detection</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Just output x,y coordinates. For example, important feature points of a face, like bounds of faces. Use 64 or more coordinates? No problem! Just need applicable training data. Also helpful for pose detection.
</p>
</div>
</div>

<div id="outline-container-org2eeadb5" class="outline-3">
<h3 id="org2eeadb5"><span class="section-number-3">3.3.</span> Object Detection</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Sliding windows detection algorithm. Example: Cars. Training set with closely cropped car/non-car images. Train a network on this data. Then, take a <i>sliding window</i> over your image and feed each windows slice into your conv net to check for cars. Once over is helpful, but now you repeat with a slightly larger region, and repeat again. Problem: costly computation. Before deep learning, this was kind of feasible. What&rsquo;s the solution? Convolutional implementation!
</p>
</div>
</div>

<div id="outline-container-org988ad70" class="outline-3">
<h3 id="org988ad70"><span class="section-number-3">3.4.</span> Convolutional Implementation of sliding windows</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Turn a fully connected layer into a convolutional layer. Take a \(5\times 5\times 16\) layer and apply 400 filters of size \(5\times 5\) to simulate an fc layer.
</p>

<p>
Using fc layers like this, you can implement sliding windows via convolution. Take the same configuration for your conv net and run it on a larger image. The result is an &rsquo;image&rsquo; that contains the results of the classification of the sliding window. You can control the parameters like stride of the sliding window through the size of an intermediate max pool layer. How exactly does it work? Needs more general explanation. It&rsquo;s hilariously poor in the video.
</p>
</div>
</div>

<div id="outline-container-orgaa7e38e" class="outline-3">
<h3 id="orgaa7e38e"><span class="section-number-3">3.5.</span> Output more accurate bounding boxes</h3>
<div class="outline-text-3" id="text-3-5">
<p>
YOLO algorithm (You only look once) for the problem of bounding boxes not matching up with the objects in the picture. 
</p>

<p>
Very similar to object localization algorithm, but with an output for \(19\times19\) grid cells, with 8 output values each (in this example). This is a convolutions implementation, and runs quite fast!
</p>

<p>
\[ \hat{y} = \begin{pmatrix}c \\ b_x \\ b_y \\ b_h \\ b_w \\ c_p \\ c_m \\ c_c \end{pmatrix} \]
</p>

<p>
Where \(0 \leq b_x, b_y, b_h, b_w \leq 1\).
</p>
</div>
</div>
