course4conv.org
** Intersection over union

Let's add to the yolo algorithm with IoU. Evaluate the cell you look at and the bounding box. Divide: size of intersection by size of union of cell and bounding box if one is found. Estimate the correctness of your prediction.

I swear if the next algorithm name is also a pun I'm gonna lose it.

** Non-max suppression example

If you have multiple detects, you take the ones with high IoU (i.e. overlap) with the highest $p_c$ and remove them. So you 'suppress' the 'non-max' bounding boxes. 

Example. 19\times19 grid cells. 
- Discard all boxes with $p_c \leq threshold.
- While there are remaining boxes:
  - Pick the box with the largest $p_c$, output as prediction. 
  - discard any remaining box with IoU \geq threshold with the largest $p_c$ box.

Actually useful description of the algorithm pulled from quora:

Input: A list of Proposal boxes B, corresponding confidence scores S and overlap threshold N.

Output: A list of filtered proposals D.

Algorithm:

    Select the proposal with highest confidence score, remove it from B and add it to the final proposal list D. (Initially D is empty).
    Now compare this proposal with all the proposals — calculate the IOU (Intersection over Union) of this proposal with every other proposal. If the IOU is greater than the threshold N, remove that proposal from B.
    Again take the proposal with the highest confidence from the remaining proposals in B and remove it from B and add it to D.
    Once again calculate the IOU of this proposal with all the proposals in B and eliminate the boxes which have high IOU than threshold.
    This process is repeated until there are no more proposals left in B.

** Anchor Boxes 

Overlapping boxes can be a problem (e.g. person in front of car). Anchor boxes help by providing additional discriminatory capacity: Each object in an image is assigned to the grid cell with the midpoint and an anchor box for the grid cell with the highest IoU between grid cell and anchor box. The output then also has to include the anchor boxes, i.e. doubles in size for two anchor boxes (weird). This helps with two objects in the same grid cell with different anchor boxes (which are just bounding boxes).

** YOLO Algorithm

Training. Suppose $3\times3\times\2\times8$, where we have $3\times3$ grid cells and 2 anchor boxes and 8 output values, which are 5 + number of classes. 

Run non-max suppression for each prediction class individually. 

The YOLO algorithm is really good I swear!

** Region proposals

R-CNN (regions with CNNs) picks regions for which is make sense to run the conv net classifier on. Segmentation algorithm first to guess what could be an object. then run the classifier over the suggestions. ca 2000. Initially quite slow. Augment with a convolutional implementation. Then also use a convolutional network to propose the regions. (How? see paper.) Still quite a bit slower than YOLO tho.

** From the Jupyter Notebook

"You Only Look Once" (YOLO) is a popular algorithm because it achieves high accuracy while also being able to run in real-time. This algorithm "only looks once" at the image in the sense that it requires only one forward propagation pass through the network to make predictions. After non-max suppression, it then outputs recognized objects together with the bounding boxes.

What you should remember:

    YOLO is a state-of-the-art object detection model that is fast and accurate
    It runs an input image through a CNN which outputs a 19x19x5x85 dimensional volume.
    The encoding can be seen as a grid where each of the 19x19 cells contains information about 5 boxes.
    You filter through all the boxes using non-max suppression. Specifically:
        Score thresholding on the probability of detecting a class to keep only accurate (high probability) boxes
        Intersection over Union (IoU) thresholding to eliminate overlapping boxes
    Because training a YOLO model from randomly initialized weights is non-trivial and requires a large dataset as well as lot of computation, we used previously trained model parameters in this exercise. If you wish, you can also try fine-tuning the YOLO model with your own dataset, though this would be a fairly non-trivial exercise.

* Week 4: Special applications: Face recognition & Neural style Transfer

** Face Recognition

Face verification vs. face recognition

Verification
- Input image, name/ID
- Output whether match

Recognition
- database of $k$ persons
- output ID if input image if any of K persons.

Recognition problem much harder, since the error multiplies for each check compared to recognition systems.

Focus first on verification systems.

** One-shot learning

This is a challenge: recognize a person with just one image (if only one picture). Not enough training data! 

Instead, learn a similarity function $d(img_1, img_2)$, with d the degree of difference between images. Then threshold.

Also better for new members of the team. 

** Siamese Network 

Fix some layer deep into the network which is the encoding of the input, say a 128 fc layer. Do the same with a second image. Calculate $d(x^{(1)},x^{(2)}) = || f(x^{(1)}, f(x^({2)} ||^2)$

Learn parameters so that: 
- If the same person, distance small.
- If a different person, distance large.

How to define the objective function here?

** Triplet Loss 

Data triplet: One anchor image A, a positive image P and a negative image N. 

Want: $d(A,P) \leq d(A,N)$

$$d(A,P) - d(A,N) + \alpha \leq 0$$

$$\mathcal{L}(A,P,N) = max(||f(A)-f(P)||^2 - ||f(A)-f(N)||^2 + \alpha, 0)$$

The cost is then the simple sum over all triplets. So the training set needs to be in triplet form. You need multiple pictures of the same person for this to work.

Choose triplets: 
- randomly problematic, since then it's easily satisfied. Choose hard problems.
- Choose such that $d(A,N) ~ d(A,P)$.

** Face Verification and Binary Classification problem

Also possible to learn the similarity function with a last layer that consists of only one unit with a sigmoid function over the difference of the two encodings, i.e.

$$ \hat{y} = \sigma(\sum w_k |f(x^{(i)}_k - f(x^{(j)})_k| + b) $$
 
for example. $\Chi^2$ -similarity might work, too.

this system might work very well, too. Your training set consists in pairs of images with labels whether they're the same person or not.

