course4conv.html

<div id="outline-container-orgf33521d" class="outline-3">
<h3 id="orgf33521d"><span class="section-number-3">3.6.</span> Intersection over union</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Let&rsquo;s add to the yolo algorithm with IoU. Evaluate the cell you look at and the bounding box. Divide: size of intersection by size of union of cell and bounding box if one is found. Estimate the correctness of your prediction.
</p>

<p>
I swear if the next algorithm name is also a pun I&rsquo;m gonna lose it.
</p>
</div>
</div>

<div id="outline-container-org1feed53" class="outline-3">
<h3 id="org1feed53"><span class="section-number-3">3.7.</span> Non-max suppression example</h3>
<div class="outline-text-3" id="text-3-7">
<p>
If you have multiple detects, you take the ones with high IoU (i.e. overlap) with the highest \(p_c\) and remove them. So you &rsquo;suppress&rsquo; the &rsquo;non-max&rsquo; bounding boxes. 
</p>

<p>
Example. 19&times;19 grid cells. 
</p>
<ul class="org-ul">
<li>Discard all boxes with $p<sub>c</sub> &le; threshold.</li>
<li>While there are remaining boxes:
<ul class="org-ul">
<li>Pick the box with the largest \(p_c\), output as prediction.</li>
<li>discard any remaining box with IoU &ge; threshold with the largest \(p_c\) box.</li>
</ul></li>
</ul>

<p>
Actually useful description of the algorithm pulled from quora:
</p>

<p>
Input: A list of Proposal boxes B, corresponding confidence scores S and overlap threshold N.
</p>

<p>
Output: A list of filtered proposals D.
</p>

<p>
Algorithm:
</p>

<p>
Select the proposal with highest confidence score, remove it from B and add it to the final proposal list D. (Initially D is empty).
Now compare this proposal with all the proposals — calculate the IOU (Intersection over Union) of this proposal with every other proposal. If the IOU is greater than the threshold N, remove that proposal from B.
Again take the proposal with the highest confidence from the remaining proposals in B and remove it from B and add it to D.
Once again calculate the IOU of this proposal with all the proposals in B and eliminate the boxes which have high IOU than threshold.
This process is repeated until there are no more proposals left in B.
</p>
</div>
</div>

<div id="outline-container-org5a696e6" class="outline-3">
<h3 id="org5a696e6"><span class="section-number-3">3.8.</span> Anchor Boxes</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Overlapping boxes can be a problem (e.g. person in front of car). Anchor boxes help by providing additional discriminatory capacity: Each object in an image is assigned to the grid cell with the midpoint and an anchor box for the grid cell with the highest IoU between grid cell and anchor box. The output then also has to include the anchor boxes, i.e. doubles in size for two anchor boxes (weird). This helps with two objects in the same grid cell with different anchor boxes (which are just bounding boxes).
</p>
</div>
</div>

<div id="outline-container-org2c60e31" class="outline-3">
<h3 id="org2c60e31"><span class="section-number-3">3.9.</span> YOLO Algorithm</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Training. Suppose \(3\times3\times\2\times8\), where we have \(3\times3\) grid cells and 2 anchor boxes and 8 output values, which are 5 + number of classes. 
</p>

<p>
Run non-max suppression for each prediction class individually. 
</p>

<p>
The YOLO algorithm is really good I swear!
</p>
</div>
</div>

<div id="outline-container-org6b900f2" class="outline-3">
<h3 id="org6b900f2"><span class="section-number-3">3.10.</span> Region proposals</h3>
<div class="outline-text-3" id="text-3-10">
<p>
R-CNN (regions with CNNs) picks regions for which is make sense to run the conv net classifier on. Segmentation algorithm first to guess what could be an object. then run the classifier over the suggestions. ca 2000. Initially quite slow. Augment with a convolutional implementation. Then also use a convolutional network to propose the regions. (How? see paper.) Still quite a bit slower than YOLO tho.
</p>
</div>
</div>

<div id="outline-container-org135b6e3" class="outline-3">
<h3 id="org135b6e3"><span class="section-number-3">3.11.</span> From the Jupyter Notebook</h3>
<div class="outline-text-3" id="text-3-11">
<p>
&ldquo;You Only Look Once&rdquo; (YOLO) is a popular algorithm because it achieves high accuracy while also being able to run in real-time. This algorithm &ldquo;only looks once&rdquo; at the image in the sense that it requires only one forward propagation pass through the network to make predictions. After non-max suppression, it then outputs recognized objects together with the bounding boxes.
</p>

<p>
What you should remember:
</p>

<p>
YOLO is a state-of-the-art object detection model that is fast and accurate
It runs an input image through a CNN which outputs a 19x19x5x85 dimensional volume.
The encoding can be seen as a grid where each of the 19x19 cells contains information about 5 boxes.
You filter through all the boxes using non-max suppression. Specifically:
    Score thresholding on the probability of detecting a class to keep only accurate (high probability) boxes
    Intersection over Union (IoU) thresholding to eliminate overlapping boxes
Because training a YOLO model from randomly initialized weights is non-trivial and requires a large dataset as well as lot of computation, we used previously trained model parameters in this exercise. If you wish, you can also try fine-tuning the YOLO model with your own dataset, though this would be a fairly non-trivial exercise.
</p>
</div>
</div>
</div>

<div id="outline-container-org1da42c6" class="outline-2">
<h2 id="org1da42c6"><span class="section-number-2">4.</span> Week 4: Special applications: Face recognition &amp; Neural style Transfer</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org176788c" class="outline-3">
<h3 id="org176788c"><span class="section-number-3">4.1.</span> Face Recognition</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Face verification vs. face recognition
</p>

<p>
Verification
</p>
<ul class="org-ul">
<li>Input image, name/ID</li>
<li>Output whether match</li>
</ul>

<p>
Recognition
</p>
<ul class="org-ul">
<li>database of \(k\) persons</li>
<li>output ID if input image if any of K persons.</li>
</ul>

<p>
Recognition problem much harder, since the error multiplies for each check compared to recognition systems.
</p>

<p>
Focus first on verification systems.
</p>
</div>
</div>

<div id="outline-container-org996748d" class="outline-3">
<h3 id="org996748d"><span class="section-number-3">4.2.</span> One-shot learning</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This is a challenge: recognize a person with just one image (if only one picture). Not enough training data! 
</p>

<p>
Instead, learn a similarity function \(d(img_1, img_2)\), with d the degree of difference between images. Then threshold.
</p>

<p>
Also better for new members of the team. 
</p>
</div>
</div>

<div id="outline-container-org7afcf9d" class="outline-3">
<h3 id="org7afcf9d"><span class="section-number-3">4.3.</span> Siamese Network</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Fix some layer deep into the network which is the encoding of the input, say a 128 fc layer. Do the same with a second image. Calculate \(d(x^{(1)},x^{(2)}) = || f(x^{(1)}, f(x^({2)} ||^2)\)
</p>

<p>
Learn parameters so that: 
</p>
<ul class="org-ul">
<li>If the same person, distance small.</li>
<li>If a different person, distance large.</li>
</ul>

<p>
How to define the objective function here?
</p>
</div>
</div>

<div id="outline-container-org32042fb" class="outline-3">
<h3 id="org32042fb"><span class="section-number-3">4.4.</span> Triplet Loss</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Data triplet: One anchor image A, a positive image P and a negative image N. 
</p>

<p>
Want: \(d(A,P) \leq d(A,N)\)
</p>

<p>
\[d(A,P) - d(A,N) + \alpha \leq 0\]
</p>

<p>
\[\mathcal{L}(A,P,N) = max(||f(A)-f(P)||^2 - ||f(A)-f(N)||^2 + \alpha, 0)\]
</p>

<p>
The cost is then the simple sum over all triplets. So the training set needs to be in triplet form. You need multiple pictures of the same person for this to work.
</p>

<p>
Choose triplets: 
</p>
<ul class="org-ul">
<li>randomly problematic, since then it&rsquo;s easily satisfied. Choose hard problems.</li>
<li>Choose such that \(d(A,N) ~ d(A,P)\).</li>
</ul>
</div>
</div>

<div id="outline-container-org03b6e14" class="outline-3">
<h3 id="org03b6e14"><span class="section-number-3">4.5.</span> Face Verification and Binary Classification problem</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Also possible to learn the similarity function with a last layer that consists of only one unit with a sigmoid function over the difference of the two encodings, i.e.
</p>

<p>
\[ \hat{y} = \sigma(\sum w_k |f(x^{(i)}_k - f(x^{(j)})_k| + b) \]
</p>

<p>
for example. \(\Chi^2\) -similarity might work, too.
</p>

<p>
this system might work very well, too. Your training set consists in pairs of images with labels whether they&rsquo;re the same person or not.
</p>
</div>
</div>
