course4conv.org
** Neural Style Transfer

Take some content (C) and recreate it (G) in the /style/ of another (S). E.g. Stanford in the style of Van Gogh.

For this, get some better intuition into what these layers in a conv net are really computing.

** What are deep Convnets really learning?

Suppose Alexnet like conv net. 
- Pick a unit in layer 1. Find the nine image patches or images in the training set that maximize the unit's activation. Repeat for other units. Also, repeat for deeper layers, too. typically, deeper units are activated by a larger portion of the image. Deeper layers tend to get activated by larger patterns, while earlier layer have simple shapes as activation (e.g. edges etc). Deeper layers then get activated by types of object.

** Cost function

$$J(G) = \alpha J_{content}(C,G) + \beta J_{style}(S,G)$$

How to generate the new image? 
1. Initialize G randomly
2. Use gradient descent to minimize J(G)
  $$G:=G- \frac{\alpha}{2G} J(G)$$

** Content Cost function

- Say you use hidden layer $l$ to compute cost, where $l$ is neither too shallow nor too deep. If too shallow, then too pixel perfect. If too high, too conceptual. Needs to look similar!
- Use pre-trained ConvNet (E.g. VGG network)
- Let $a^{[l](C)}$ be the activation of layer $l$ of C, G analogously.
- if both activations are similar, both images have similar content.
$$J_{content}(C,G) = || a^{[l](C)} - a^{[l](G)} ||^2$$

** Style Cost function 

What does Style of image mean? Take some layer $l$ as definitive of the style. Define style as correlation between activations across channels. 

Define style matrix. 

Let $a^{[l]}_{i,j,k}$ be the activation at $i,j,k$.

$G^{[l]}$ is an $n^{[l]}_C \times n_C^{[l]}$ matrix which measures the correlation between the channels of layer $l$.

The additional superscript $(S)$ and $(G)$ refer to the style and generated image, respectively.

$$G^{[l](G)}_{kk'} = \sum^{n_H}_{i=1}\sum_{j=1}^{n_W} a^{[l](G)}_{i,j,k} a^{[l](G)}_{i,j,k'}$$

In linear algebra, these style matrices are called 'gram matrix'.

$$J^{[l]}_{style}(S,G) = \frac{1}{(2n^{[l]}_H n^{[l]}_W n^{[l]}_C)^2} \sum_k \sum_{k'} (G^{[l](S)}_{kk'} - G^{[l](G)}_{kk'})^2$$

Better results with multiple layers!

$$J_{style}(S,G) = \sum_l \lambda^{[l]} J_{style}^{[l]} (S,G)$$

where lambda is a hyper parameter. 

** 1D and 3D generalization of conv nets

1D: ekg heartbeat. Say 14 \times 1 * 5 \times 1 \rightarrow 10 \times 16 (if you have 16 filters). 

But usually, for 1-d data you'd usually use recurrent neural nets.

The case for 3D is completely straightforward. Useful for CAT scans, or movie data, etc p.p. 

Guess what! This generalizes arbitrarily. 

** Notes from the Jupyter Notebook?

How is it achieved that the gradient descent is performed on the image and not on the model's parameters? Even after completing the assignment, it hasn't become clear :(

G(gram)i,jG(gram)i,j: correlation

The result is a matrix of dimension (nC,nC)(nC,nC) where nCnC is the number of filters (channels). The value G(gram)i,jG(gram)i,j measures how similar the activations of filter ii are to the activations of filter jj.
G(gram),i,iG(gram),i,i: prevalence of patterns or textures

    The diagonal elements G(gram)iiG(gram)ii measure how "active" a filter ii is.
    For example, suppose filter ii is detecting vertical textures in the image. Then G(gram)iiG(gram)ii measures how common vertical textures are in the image as a whole.
    If G(gram)iiG(gram)ii is large, this means that the image has a lot of vertical texture.

By capturing the prevalence of different types of features (G(gram)iiG(gram)ii), as well as how much different features occur together (G(gram)ijG(gram)ij), the Style matrix GgramGgram measures the style of an image. 

