course4conv.html

<div id="outline-container-org497954f" class="outline-3">
<h3 id="org497954f"><span class="section-number-3">4.6.</span> Neural Style Transfer</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Take some content (C) and recreate it (G) in the <i>style</i> of another (S). E.g. Stanford in the style of Van Gogh.
</p>

<p>
For this, get some better intuition into what these layers in a conv net are really computing.
</p>
</div>
</div>

<div id="outline-container-orga55ae27" class="outline-3">
<h3 id="orga55ae27"><span class="section-number-3">4.7.</span> What are deep Convnets really learning?</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Suppose Alexnet like conv net. 
</p>
<ul class="org-ul">
<li>Pick a unit in layer 1. Find the nine image patches or images in the training set that maximize the unit&rsquo;s activation. Repeat for other units. Also, repeat for deeper layers, too. typically, deeper units are activated by a larger portion of the image. Deeper layers tend to get activated by larger patterns, while earlier layer have simple shapes as activation (e.g. edges etc). Deeper layers then get activated by types of object.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc93400f" class="outline-3">
<h3 id="orgc93400f"><span class="section-number-3">4.8.</span> Cost function</h3>
<div class="outline-text-3" id="text-4-8">
<p>
\[J(G) = \alpha J_{content}(C,G) + \beta J_{style}(S,G)\]
</p>

<p>
How to generate the new image? 
</p>
<ol class="org-ol">
<li>Initialize G randomly</li>
<li>Use gradient descent to minimize J(G)
\[G:=G- \frac{\alpha}{2G} J(G)\]</li>
</ol>
</div>
</div>

<div id="outline-container-org46e4068" class="outline-3">
<h3 id="org46e4068"><span class="section-number-3">4.9.</span> Content Cost function</h3>
<div class="outline-text-3" id="text-4-9">
<ul class="org-ul">
<li>Say you use hidden layer \(l\) to compute cost, where \(l\) is neither too shallow nor too deep. If too shallow, then too pixel perfect. If too high, too conceptual. Needs to look similar!</li>
<li>Use pre-trained ConvNet (E.g. VGG network)</li>
<li>Let \(a^{[l](C)}\) be the activation of layer \(l\) of C, G analogously.</li>
<li>if both activations are similar, both images have similar content.</li>
</ul>
<p>
\[J_{content}(C,G) = || a^{[l](C)} - a^{[l](G)} ||^2\]
</p>
</div>
</div>

<div id="outline-container-org0f76de8" class="outline-3">
<h3 id="org0f76de8"><span class="section-number-3">4.10.</span> Style Cost function</h3>
<div class="outline-text-3" id="text-4-10">
<p>
What does Style of image mean? Take some layer \(l\) as definitive of the style. Define style as correlation between activations across channels. 
</p>

<p>
Define style matrix. 
</p>

<p>
Let \(a^{[l]}_{i,j,k}\) be the activation at \(i,j,k\).
</p>

<p>
\(G^{[l]}\) is an \(n^{[l]}_C \times n_C^{[l]}\) matrix which measures the correlation between the channels of layer \(l\).
</p>

<p>
The additional superscript \((S)\) and \((G)\) refer to the style and generated image, respectively.
</p>

<p>
\[G^{[l](G)}_{kk'} = \sum^{n_H}_{i=1}\sum_{j=1}^{n_W} a^{[l](G)}_{i,j,k} a^{[l](G)}_{i,j,k'}\]
</p>

<p>
In linear algebra, these style matrices are called &rsquo;gram matrix&rsquo;.
</p>

<p>
\[J^{[l]}_{style}(S,G) = \frac{1}{(2n^{[l]}_H n^{[l]}_W n^{[l]}_C)^2} \sum_k \sum_{k'} (G^{[l](S)}_{kk'} - G^{[l](G)}_{kk'})^2\]
</p>

<p>
Better results with multiple layers!
</p>

<p>
\[J_{style}(S,G) = \sum_l \lambda^{[l]} J_{style}^{[l]} (S,G)\]
</p>

<p>
where lambda is a hyper parameter. 
</p>
</div>
</div>

<div id="outline-container-orgde9bf53" class="outline-3">
<h3 id="orgde9bf53"><span class="section-number-3">4.11.</span> 1D and 3D generalization of conv nets</h3>
<div class="outline-text-3" id="text-4-11">
<p>
1D: ekg heartbeat. Say 14 &times; 1 * 5 &times; 1 &rarr; 10 &times; 16 (if you have 16 filters). 
</p>

<p>
But usually, for 1-d data you&rsquo;d usually use recurrent neural nets.
</p>

<p>
The case for 3D is completely straightforward. Useful for CAT scans, or movie data, etc p.p. 
</p>

<p>
Guess what! This generalizes arbitrarily. 
</p>
</div>
</div>

<div id="outline-container-orge4229d5" class="outline-3">
<h3 id="orge4229d5"><span class="section-number-3">4.12.</span> Notes from the Jupyter Notebook?</h3>
<div class="outline-text-3" id="text-4-12">
<p>
How is it achieved that the gradient descent is performed on the image and not on the model&rsquo;s parameters? Even after completing the assignment, it hasn&rsquo;t become clear :(
</p>

<p>
G(gram)i,jG(gram)i,j: correlation
</p>

<p>
The result is a matrix of dimension (nC,nC)(nC,nC) where nCnC is the number of filters (channels). The value G(gram)i,jG(gram)i,j measures how similar the activations of filter ii are to the activations of filter jj.
G(gram),i,iG(gram),i,i: prevalence of patterns or textures
</p>

<p>
The diagonal elements G(gram)iiG(gram)ii measure how &ldquo;active&rdquo; a filter ii is.
For example, suppose filter ii is detecting vertical textures in the image. Then G(gram)iiG(gram)ii measures how common vertical textures are in the image as a whole.
If G(gram)iiG(gram)ii is large, this means that the image has a lot of vertical texture.
</p>

<p>
By capturing the prevalence of different types of features (G(gram)iiG(gram)ii), as well as how much different features occur together (G(gram)ijG(gram)ij), the Style matrix GgramGgram measures the style of an image. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: By Me</p>
<p class="date">Created: 2022-09-26 Mo 16:58</p>
</div>
</body>
</html>
